{
  "date": "02-19-2026",
  "forecasts": [
    {
      "zone": "Glacier/Flathead",
      "primary_concern": "Wet Loose Avalanches",
      "discussion": "Atmospheric warming is the primary driver of instability as temperatures reach 13°C at lower elevations and remain above freezing at upper elevations. Significant solar radiation, measured at 1175 W/m² on upper south aspects, combined with liquid water content reaching 0.51 at middle elevations, is actively degrading surface cohesion. South-facing slopes across all elevation bands are most affected by diurnal warming and the transition toward an isothermal surface layer. While northern aspects remain more stable, the lack of an overnight freeze at lower and middle elevations prevents the snowpack from recovering strength.",
      "travel_advice": "Avoid travel on or beneath steep, sun-exposed slopes during the heat of the day. Monitor for signs of increasing instability such as rollerballs, pinwheels, or small natural point releases. The safest and highest quality snow is located on high-elevation, north-facing slopes that remain sheltered from direct solar radiation."
    },
    {
      "zone": "Swan",
      "primary_concern": "Wet Loose Avalanches",
      "discussion": "The snowpack is under intense thermal stress with temperatures exceeding 10°C at all elevation bands. High solar gain on south-facing slopes, particularly at middle elevations where radiation reaches 1786 W/m², is promoting rapid melting and the presence of liquid water in the upper snowpack. Surface cohesion is rapidly decreasing on all aspects, though southern aspects are the most critical. At upper elevations, while wind transport is present at 0.94, the dominant hazard remains the loss of structural integrity due to the unseasonably warm air mass and high solar input.",
      "travel_advice": "Limit exposure to steep terrain and runout zones on southern aspects during periods of peak warming. Be cautious of terrain traps where even small wet loose slides could be dangerous. Seek out high-elevation, north-facing terrain for the most stable and well-preserved snow conditions."
    },
    {
      "zone": "Whitefish",
      "primary_concern": "Wet Loose Avalanches",
      "discussion": "Warming temperatures are impacting the snowpack surface, with lower elevations reaching 11.1°C and middle elevations at 8.8°C. Liquid water accumulation is most significant on lower-elevation southern aspects, reaching a mass of 0.9, which corresponds with a danger level of 2. Middle elevations exhibit a danger level of 1, but still experience solar-driven softening on south-facing slopes where radiation reaches 1343 W/m². The overall trend shows a loss of surface strength on all sun-exposed aspects due to consistent positive temperatures and solar gain.",
      "travel_advice": "Exercise caution on steep southern aspects and monitor for increasing snow moisture and pinwheeling throughout the day. Avoid steep lower-elevation slopes where the liquid water content is highest. The highest quality and most stable snow is located on sheltered northern aspects at middle elevations."
    }
  ]
}