{
  "date": "02-17-2026",
  "forecasts": [
    {
      "zone": "Glacier/Flathead",
      "primary_concern": "Wind Slabs and Wet Loose Avalanches",
      "discussion": "At upper elevations, the avalanche danger is Considerable (Level 3). Colder temperatures (21.2°F) and moderate wind transport (0.59) are facilitating the development of wind slabs on leeward aspects, particularly North and East slopes. In the middle elevation band, danger remains Moderate (Level 2) with wind transport (0.42) and new snow accumulation contributing to slab formation. At lower elevations, temperatures near the freezing mark (30.3°F) and increasing liquid water content on southern aspects (0.21) indicate a rising potential for wet loose avalanches on steep solar-exposed terrain.",
      "travel_advice": "Avoid steep, wind-loaded slopes at upper elevations, especially those near ridge lines. On southern aspects at middle and lower elevations, watch for signs of snowpack warming such as roller balls or pinwheels, and transition away from these areas as they soften. The safest and highest quality snow can be found on sheltered, low-angle terrain on North to Northeast aspects where wind effect is minimal and the snowpack remains cold."
    },
    {
      "zone": "Swan",
      "primary_concern": "Wind Slabs and Storm Slabs",
      "discussion": "Considerable avalanche danger (Level 3) exists at both upper and middle elevations. Significant wind transport (0.57 at mid-elevations) combined with 3.6 inches of new snow is creating reactive wind slabs. The snowpack at mid-elevations shows a significant increase in liquid water content (1.85) on southern aspects, suggesting structural weakening during periods of solar gain. Lower elevations remain at Low danger (Level 1) with minimal wind transport and less snow accumulation, resulting in a generally stable snowpack in the valley bottoms.",
      "travel_advice": "Limit travel in steep, high-consequence terrain at mid and upper elevations. Avoid lee-side slopes where wind-deposited snow has formed stiff slabs. Give cornices a wide berth. For the safest conditions and best snow quality, stick to lower elevation bands or sheltered, mid-elevation North-facing glades with slope angles less than 30 degrees."
    },
    {
      "zone": "Whitefish",
      "primary_concern": "Wet Loose and Wind Slabs",
      "discussion": "Moderate avalanche danger (Level 2) is present across lower and middle elevation bands. Mid-elevation terrain is seeing moderate wind transport (0.38) which is building localized wind slabs on North and East aspects. Lower elevations are experiencing significant warming, with liquid water mass reaching 2.47 on southern aspects. This indicates a high probability of wet loose activity on steep solar slopes as the day progresses. Snow depths vary significantly by aspect, with North-facing slopes maintaining the deepest and most consistent coverage.",
      "travel_advice": "Exercise caution on steep southern aspects at all elevations, as the high liquid water content increases the likelihood of wet snow slides. Monitor mid-elevation ridges for wind-stiffened snow. The best and safest skiing will be found on sheltered, high-latitude aspects (North and Northwest) that have been protected from both wind scouring and solar radiation."
    }
  ]
}