{
  "date": "02-18-2026",
  "forecasts": [
    {
      "zone": "Glacier/Flathead",
      "primary_concern": "Wind-drifted snow and wet-snow instabilities on solar aspects.",
      "discussion": "Upper elevation bands remain cold with a significant cold content of -8 on east aspects and temperatures averaging -3.4F. Minor liquid water (0.11) is present on upper-elevation east slopes, while mid-elevation south-facing slopes show more pronounced warming with liquid water content at 0.85. Lower elevations received the highest new snow accumulation of 2.1 inches. Moderate westerly winds are driving snow transport (0.57) across lower bands, while ridge-top transport remains low. Slopes with northern and western aspects remain drier and colder across all elevations.",
      "travel_advice": "Avoid steep south-facing aspects during periods of peak solar radiation to prevent wet loose avalanches. Be cautious on leeward east-facing slopes where thin wind slabs or moist snow may be reactive. The best snow, providing the safest and highest quality conditions, is found on protected north-facing slopes at middle elevations."
    },
    {
      "zone": "Swan",
      "primary_concern": "Wind-slab development and solar-induced surface warming.",
      "discussion": "A temperature inversion is observed with upper elevations at 11.5F, while middle elevations are cooler at 10.1F. New snow increases with altitude, peaking at 4.9 inches in the upper band. Strong westerly winds (12.4 mph) are actively transporting snow (0.49) onto leeward north and east aspects. At middle elevations, south-facing slopes are experiencing significant solar gain, resulting in a liquid water content of 0.83. Lower elevations remain stable with 2.8 inches of new snow and minimal wind influence.",
      "travel_advice": "Stay off steep, upper-elevation slopes on north and east aspects where wind-loading has created reactive slabs. Monitor south-facing terrain at mid-elevations for increasing wet-snow hazard as the day progresses. The best snow is located on mid-elevation north-facing glades which offer the best combination of safety and fresh snow quality."
    },
    {
      "zone": "Whitefish",
      "primary_concern": "Wet loose avalanche activity on sun-exposed slopes.",
      "discussion": "New snow amounts are light, ranging from 1.6 inches at lower elevations to 2.3 inches at middle elevations. The primary concern is the rapid warming of south-facing aspects at lower elevations, where liquid water content has reached 1.18. East-facing lower slopes also show minor warming (0.06). Middle elevations remain cooler at 8.0F, though south aspects there also show early signs of liquid water (0.06). Wind transport is negligible across the zone, with wind speeds remaining below 8 mph. The overall snow depth is thin, ranging between 12 and 30 cm.",
      "travel_advice": "Limit travel on steep south-facing terrain below treeline where liquid water content indicates a high risk of wet loose slides. Exercise caution on steep slopes with new snow, though wind-slab risk is currently low. The highest quality and safest skiing is found on north and west-facing aspects at middle elevations where the snowpack remains cold and dry."
    }
  ]
}